app/controllers/forum_threads/forum_posts_controller.rb

INSERT INTO "forum_posts" ("body", "forum_thread_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "<p>\r\ndude\r\n1. point first\r\n2. pont second"], ["forum_thread_id", 1], ["user_id", 3], ["created_at", "2015-06-07 02:45:01.460759"], ["updated_at", "2015-06-07 02:45:01.460759"]]
---
  def create
    @forum_post = @forum_thread.forum_posts.new forum_post_params
    @forum_post.user = current_user

    if @forum_post.save

SELECT  "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_forum_thread
      @forum_thread = ForumThread.find(params[:forum_thread_id])