app/views/inventories/_form.html.erb

      <%= f.label :category_id %><br>
      <%= f.collection_select :category_id, Category.all, :id, :name, { prompt: "Choose a Category" }
---
SELECT "categories".* FROM "categories"