app/controllers/job_lists/comments_controller.rb

SELECT  "job_lists".* FROM "job_lists" WHERE "job_lists"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_commentable
        @commentable = JobList.find(params[:job_list_id])