app/views/users/show.html.erb

SELECT "forums".* FROM "forums" WHERE "forums"."user_id" = ?  [["user_id", 1]]
---
<h2>Forums</h2>
<% @user.forums.each do |forum| %>

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 2]]
---
<h2>Events</h2>
<% @user.events.each do |event| %>

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = ?  [["user_id", 1]]
---
<h2>Items for Sale</h2>
<% @user.inventories.each do |item| %>