app/views/events/_user.html.erb

     <div class='panel-body'>
             <% current_user.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 3]]