app/views/events/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
---
    </div>
    <% @event.comments.each do |comment| %>