app/views/posts/your_posts.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
<div class="row">
    <% current_user.posts.each do |post| %>