app/views/job_lists/_user.html.erb

     <div class='panel-body'>
             <% current_user.job_lists.each do |job| %>
---
SELECT "job_lists".* FROM "job_lists" WHERE "job_lists"."user_id" = ?  [["user_id", 3]]