app/views/job_lists/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."job_list_id" = ?  [[nil, 8]]
---
    </div>
    <% @job_list.comments.each do |comment| %>