app/controllers/anons_controller.rb

SELECT "anons".* FROM "anons"
---
  def index
    @anons = Anon.all

INSERT INTO "anons" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "anon 1"], ["body", "sadkas"], ["user_id", 2], ["created_at", "2015-06-10 15:44:24.544292"], ["updated_at", "2015-06-10 15:44:24.544292"]]
---
  def create
    @anon = Anon.new(anon_params)

    respond_to do |format|
      if @anon.save

SELECT  "anons".* FROM "anons" WHERE "anons"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_anon
      @anon = Anon.find(params[:id])