app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" INNER JOIN (
---
  def index
    @comments = Comment.all

INSERT INTO "comments" ("entry", "user_id", "job_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["entry", "lets see if this work"], ["user_id", 1], ["job_list_id", 12], ["created_at", "2015-06-05 00:17:11.966414"], ["updated_at", "2015-06-05 00:17:11.966414"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save