app/controllers/events_controller.rb

SELECT "events".* FROM "events"  ORDER BY created_at DESC
SELECT DISTINCT "events".* FROM "events"  ORDER BY created_at DESC
---
  def index
      @q = Event.search(params[:q])
    @events =  @q.result(distinct: true).order("created_at DESC")

INSERT INTO "events" ("description", "cost", "where", "title", "start_time", "end_time", "start_day", "end_day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "event_image_id" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_image_id", "1dbf85d37020d85077b0aa38d57afd80a0719075930e23c1f7fe33fd4cf2"], ["updated_at", "2015-06-08 02:29:58.406478"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)