app/controllers/forum_threads_controller.rb

INSERT INTO "forum_posts" ("body", "user_id", "forum_thread_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "For realz"], ["user_id", 3], ["forum_thread_id", 1], ["created_at", "2015-06-07 01:02:13.063683"], ["updated_at", "2015-06-07 01:02:13.063683"]]
INSERT INTO "forum_threads" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First thread"], ["user_id", 3], ["created_at", "2015-06-07 01:02:13.062270"], ["updated_at", "2015-06-07 01:02:13.062270"]]
---
  def create
    @forum_thread = current_user.forum_threads.new forum_thread_params
    @forum_thread.forum_posts.first.user_id = current_user.id

    if @forum_thread.save

SELECT  "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_forum_thread
      @forum_thread = ForumThread.find(params[:id])