app/controllers/forums_controller.rb

INSERT INTO "forums" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @forum = Forum.new(forum_params)

    respond_to do |format|
      if @forum.save

DELETE FROM "forums" WHERE "forums"."id" = ?  [["id", 1]]
---
  def destroy
    @forum.destroy

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_forum
      @forum = Forum.find(params[:id])