app/controllers/homepages_controller.rb

  def index
    @homepages = Homepage.all
---
SELECT "homepages".* FROM "homepages"