app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"  ORDER BY created_at DESC
---
    def index
        @inventories = Inventory.all

INSERT INTO "inventories" ("title", "description", "condition", "price", "isbn", "user_id", "category_id", "item_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save

DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 2]]
---
  def destroy
    @inventory.destroy