app/controllers/job_lists_controller.rb

  def index
         @q = JobList.search(params[:q])
    @job_lists =  @q.result(distinct: true).order("created_at DESC")
---
SELECT "job_lists".* FROM "job_lists"  ORDER BY created_at DESC
SELECT DISTINCT "job_lists".* FROM "job_lists"  ORDER BY created_at DESC

  def create
    @job_list = JobList.new(job_list_params)

    respond_to do |format|
      if @job_list.save
---
INSERT INTO "job_lists" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Interns"], ["description", "new position at serviceU great nonpay"], ["user_id", 1], ["created_at", "2015-06-04 17:37:08.915723"], ["updated_at", "2015-06-04 17:37:08.915723"]]

  def destroy
    @job_list.destroy
---
DELETE FROM "job_lists" WHERE "job_lists"."id" = ?  [["id", 1]]

    def set_job_list
      @job_list = JobList.find(params[:id])
---
SELECT  "job_lists".* FROM "job_lists" WHERE "job_lists"."id" = ? LIMIT 1  [["id", 1]]