app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This forum"], ["content", "looks like ...."], ["user_id", 1], ["created_at", "2015-06-05 21:46:10.945421"], ["updated_at", "2015-06-05 21:46:10.945421"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "jake s"], ["user_id", 3], ["updated_at", "2015-06-06 20:31:23.701257"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)