app/views/forum_threads/_user.html.erb

SELECT "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."user_id" = ?  [["user_id", 3]]
---
     <div class='panel-body'>
         <% current_user.forum_threads.each do |forum| %>